<?php
class Util_SalesControl {

	public static function zzk_customer_flag_new($id , $dest_id, $f = true){
		//计算当天客人数量
		$dao_customer = new Dao_Customer_Info();
		$count = $dao_customer->count_customer_by_dest_id($dest_id,date('Y-m-d'));

		$i = 0;
		$j = 0;
	    
	     $a = array(
              $i++ => 'B', // 张飞龙 [B]      //1
              $i++ => 'D', // 廖云 [D]
              $i++ => 'K', // 张晓欢 [K]
              $i++ => 'HU', // 胡益平[HU]
              $i++ => 'M', // 黄愈雁 [M]
              $i++ => 'N', // 郑丽丽 [N]
     	      $i++ => 'O', // 凌菡 [O]
	      $i++ => 'Q', // 黄丹[Q]
              $i++ => 'S', // 梁越 [S]
              $i++ => 'J', // 许超群[J]
              $i++ => 'CQ', // 钱慧敏[CQ]
              $i++ => 'XX', // 吕秀新[XX]
              $i++ => 'WF', // 王帆[WF]
              $i++ => 'GY', // 郭裕[GY]
              $i++ => 'JPB', // 曹莹莹 [JPB]
              $i++ => 'JPC', // 陈百灵 [JPC]
              $i++ => 'JPD', // 王枭渊 [JPD]
              $i++ => 'ZQF', // 周情风 [ZQF]
              $i++ => 'FYQ', // 范永群 [FYQ]
              $i++ => 'WX', // 吴茜[WX]
              $i++ => 'MXY', // 穆喜迎[MXY]
              $i++ => 'B', // 张飞龙 [B]    //2
              $i++ => 'D', // 廖云 [D]
              $i++ => 'K', // 张晓欢 [K]
              $i++ => 'HU', // 胡益平[HU]
              $i++ => 'M', // 黄愈雁 [M]
              $i++ => 'N', // 郑丽丽 [N]
     	        $i++ => 'O', // 凌菡 [O]
	            $i++ => 'Q', // 黄丹[Q]
              $i++ => 'S', // 梁越 [S]
              $i++ => 'J', // 许超群[J]
              $i++ => 'CQ', // 钱慧敏[CQ]
              $i++ => 'XX', // 吕秀新[XX]
              $i++ => 'WF', // 王帆[WF]
              $i++ => 'GY', // 郭裕[GY]
              $i++ => 'JPB', // 曹莹莹 [JPB]
              $i++ => 'JPC', // 陈百灵 [JPC]
              $i++ => 'JPD', // 王枭渊 [JPD]
              $i++ => 'ZQF', // 周情风 [ZQF]
              $i++ => 'FYQ', // 范永群 [FYQ]
              $i++ => 'WX', // 吴茜[WX]
              $i++ => 'MXY', // 穆喜迎[MXY]
              $i++ => 'B', // 张飞龙 [B]     //3
              $i++ => 'D', // 廖云 [D]
              $i++ => 'K', // 张晓欢 [K]
              $i++ => 'HU', // 胡益平[HU]
              $i++ => 'M', // 黄愈雁 [M]
              $i++ => 'N', // 郑丽丽 [N]
     	        $i++ => 'O', // 凌菡 [O]
	            $i++ => 'Q', // 黄丹[Q]
              $i++ => 'S', // 梁越 [S]
              $i++ => 'J', // 许超群[J]
              $i++ => 'CQ', // 钱慧敏[CQ]
              $i++ => 'XX', // 吕秀新[XX]
              $i++ => 'WF', // 王帆[WF]
              $i++ => 'GY', // 郭裕[GY]
              $i++ => 'JPB', // 曹莹莹 [JPB]
              $i++ => 'JPC', // 陈百灵 [JPC]
              $i++ => 'JPD', // 王枭渊 [JPD]
              $i++ => 'B', // 张飞龙 [B]      //4
              $i++ => 'D', // 廖云 [D]
              $i++ => 'K', // 张晓欢 [K]
              $i++ => 'HU', // 胡益平[HU]
              $i++ => 'M', // 黄愈雁 [M]
              $i++ => 'N', // 郑丽丽 [N]
	            $i++ => 'O', // 凌菡 [O]
	            $i++ => 'Q', // 黄丹[Q]
              $i++ => 'S', // 梁越 [S]
              $i++ => 'J', // 许超群[J]
              $i++ => 'CQ', // 钱慧敏[CQ]
              $i++ => 'XX', // 吕秀新[XX]
              $i++ => 'WF', // 王帆[WF]
              $i++ => 'GY', // 郭裕[GY]
              $i++ => 'JPB', // 曹莹莹 [JPB]
              $i++ => 'JPC', // 陈百灵 [JPC]
              $i++ => 'JPD', // 王枭渊 [JPD]
	      $i++ => 'B', // 张飞龙 [B]    //5
        $i++ => 'D', // 廖云 [D]
        $i++ => 'K', // 张晓欢 [K]
        $i++ => 'HU', // 胡益平[HU]
        $i++ => 'M', // 黄愈雁 [M]
        $i++ => 'JPC', // 陈百灵 [JPC]
        $i++ => 'JPD', // 王枭渊 [JPD]
        $i++ => 'JPB', // 曹莹莹 [JPB]
        $i++ => 'N', // 郑丽丽 [N]
        $i++ => 'XX', // 吕秀新[XX]
        );

   $b = array(
              $j++ => '3424',  // 张飞龙 [B]   //1
              $j++ => '10841', // 廖云 [D]
              $j++ => '31280', // 张晓欢 [K]
              $j++ => '34495', // 胡益平[HU]
              $j++ => '58948', // 黄愈雁 [M]
              $j++ => '63003', // 郑丽丽 [N]
	      $j++ => '76695', // 凌菡 [O]
	      $j++ => '81799', // 黄丹[Q]
              $j++ => '95927',  //梁越 [S]
              $j++ => '90963', // 许超群[J]
              $j++ => '93702', // 钱慧敏[CQ]
              $j++ => '95694', // 吕秀新[XX]
              $j++ => '95925', // 王帆[WF]
              $j++ => '100865', // 郭裕[GY]
              $j++ => '30916', // 曹莹莹 [JPB]
              $j++ => '47791', // 陈百灵 [JPC]
              $j++ => '79937', // 王枭渊 [JPD]
              $j++ => '100861', // 周情风[ZQF]
              $j++ => '107621', // 范永群[FYQ]
              $j++ => '108858', // 吴茜[WX]
              $j++ => '107614', // 穆喜迎[MXY]
              $j++ => '3424',  // 张飞龙 [B]  //2
              $j++ => '10841', // 廖云 [D]
              $j++ => '31280', // 张晓欢 [K]
              $j++ => '34495', // 胡益平[HU]
              $j++ => '58948', // 黄愈雁 [M]
              $j++ => '63003', // 郑丽丽 [N]
      	      $j++ => '76695', // 凌菡 [O]
      	      $j++ => '81799', // 黄丹[Q]
              $j++ => '95927',  //梁越 [S]
              $j++ => '90963', // 许超群[J]
              $j++ => '93702', // 钱慧敏[CQ]
              $j++ => '95694', // 吕秀新[XX]
              $j++ => '95925', // 王帆[WF]
              $j++ => '100865', // 郭裕[GY]
              $j++ => '30916', // 曹莹莹 [JPB]
              $j++ => '47791', // 陈百灵 [JPC]
              $j++ => '79937', // 王枭渊 [JPD]
              $j++ => '100861', // 周情风[ZQF]
              $j++ => '107621', // 范永群[FYQ]
              $j++ => '108858', // 吴茜[WX]
              $j++ => '107614', // 穆喜迎[MXY]
              $j++ => '3424',  // 张飞龙 [B]  //3
              $j++ => '10841', // 廖云 [D]
              $j++ => '31280', // 张晓欢 [K]
              $j++ => '34495', // 胡益平[HU]
              $j++ => '58948', // 黄愈雁 [M]
              $j++ => '63003', // 郑丽丽 [N]
	      $j++ => '76695', // 凌菡 [O]
	      $j++ => '81799', // 黄丹[Q]
              $j++ => '95927',  //梁越 [S]
              $j++ => '90963', // 许超群[J]
              $j++ => '93702', // 钱慧敏[CQ]
              $j++ => '95694', // 吕秀新[XX]
              $j++ => '95925', // 王帆[WF]
              $j++ => '100865', // 郭裕[GY]
              $j++ => '30916', // 曹莹莹 [JPB]
              $j++ => '47791', // 陈百灵 [JPC]
              $j++ => '79937', // 王枭渊 [JPD]
              $j++ => '3424',  // 张飞龙 [B]   //4
              $j++ => '10841', // 廖云 [D]
              $j++ => '31280', // 张晓欢 [K]
              $j++ => '34495', // 胡益平[HU]
              $j++ => '58948', // 黄愈雁 [M]
              $j++ => '63003', // 郑丽丽 [N]
      	      $j++ => '76695', // 凌菡 [O]
      	      $j++ => '81799', // 黄丹[Q]
              $j++ => '95927',  //梁越 [S]
              $j++ => '90963', // 许超群[J]
              $j++ => '93702', // 钱慧敏[CQ]
              $j++ => '95694', // 吕秀新[XX]
              $j++ => '95925', // 王帆[WF]
              $j++ => '100865', // 郭裕[GY]
              $j++ => '30916', // 曹莹莹 [JPB]
              $j++ => '47791', // 陈百灵 [JPC]
              $j++ => '79937', // 王枭渊 [JPD]
	      $j++ => '3424',  // 张飞龙 [B]     //5
        $j++ => '10841', // 廖云 [D]
        $j++ => '31280', // 张晓欢 [K]
        $j++ => '34495', // 胡益平[HU]
        $j++ => '58948', // 黄愈雁 [M]
        $j++ => '47791', // 陈百灵 [JPC]
        $j++ => '79937', // 王枭渊 [JPD]
        $j++ => '30916', // 曹莹莹 [JPB]
        $j++ => '63003', // 郑丽丽 [N]
        $j++ => '95694', // 吕秀新[XX]
   );
		
		$flag_int = (int)($count%$i);
		if($f){
			return isset($a[$flag_int]) ? $a[$flag_int] : "null";
		}
		else{
			return isset($b[$flag_int]) ? $b[$flag_int] : "0";
		}
	}


	/**
	 * 功能：日本团队销售跟进客人标记
	 */
	public static function zzk_customer_flag_japan($id , $dest_id , $f = true){
		//计算当天客人数量
		$dao_customer = new Dao_Customer_Info();
		$count = $dao_customer->count_customer_by_dest_id($dest_id,date('Y-m-d'));

		$i = 0;
		$j = 0;
		$a = array(
			$i++ => 'CJR',
		);

		$b = array(
			$j++ => '99014',
		);

		$flag_int = (int)($count%$i);
		if($f){
			return isset($a[$flag_int]) ? $a[$flag_int] : "null";
		}
		else{
			return isset($b[$flag_int]) ? $b[$flag_int] : "0";
		}
	}
}
?>
