<?php
$config['order_source']='alitrip';
$config['uid']='385798';
$config['resultCode'] = array(
    '200' => 'sucess',
    '400' => '请求参数错误',
    '401' => 'invalid room',
    '402' => 'invalid homestay',
    '403' => '姓名不能为空',
    '404' => '联系方式好像不对哦',
    '405' => '电子邮箱不能为空',
    '406' => '入住时间不正确',
    '407' => '退房时间不正确',
    '408' => '当天已经没有房间了~',
    '409' => '房间连住条件不满足',
    '2'=>'民宿休假或者房间下架或者民宿终止合作',
    '201'=>'网站端下单成功[非速订]',
    '204'=>'不存此订单',
    '206'=>'价格政策原因不允许下单',
    '205'=>'订单已取消',
    '207'=>'价格校验失败',
    '208'=>'入住日期小于30天不允许退订'
);