<?php
$config['festival_cn'] = array(
	'2015-09-27' => '中秋',
	'2015-10-01' => '国庆',
    '2016-04-04' => '清明',
    '2016-05-01' => '劳动节',
    '2016-06-09' => '端午',
    '2016-09-15' => '中秋',
    '2016-10-01' => '国庆',
    '2017-01-01' => '元旦',
    '2017-01-28' => '春节',
    '2017-04-04' => '清明',
);

/*
元旦	1月1日~1月3日	1月4日（周日）上班	共3天
春节	2月18日(除夕）~2月24日	2月15日（周日）、2月28日（周六）上班	共7天
清明节	4月4日~4月6日	4月6日（周一）补休、含周末公休	共3天
劳动节	5月1日~5月3日	与5月2日（周六）、5月3日（周日）连休	共3天
端午节	6月20日~6月22日	6月22日（周一）补休、含周末公休	共3天
胜利日	9月3日~9月5日	9月4日调休、9月6日（周日）上班	共3天
中秋节	9月26日~9月27日	含周末公休	共2天
国庆节	10月1日~10月7日	10月10日（周六）上班
*/
